       identification division.
       program-id. SAMPLE01.
       environment division.
       configuration section.

       data division.
       working-storage section.